# -- 02-a-0100
# Направете копие на файла /etc/passwd във вашата home директория под името my_passwd.

function 02-a-0100


# -- 02-a-0500
# Направете директория practice-test в home директорията ви. Вътре направете 
# директория test1. Можете ли да направите тези две неща наведнъж? Разгледайте 
# нужната man страница. След това създайте празен файл вътре, който да се казва 
# test.txt, преместете го в practice-test чрез релативни пътища.

function 02-a-0500


# -- 02-a-0600
# Копирайте файловете f1, f2, f3 от директорията /tmp/os2018/practice/01/ в 
# директория dir1, намираща се във вашата home директория. Ако нямате такава, 
# създайте я.

function 02-a-0600


# -- 02-a-0601
# Нека файлът f2 бъде преместен в директория dir2, намираща се във вашата home 
# директория и бъде преименуван на numbers.

function 02-a-0601


# -- 02-a-1200
# Отпечатайте имената на всички директории в директорията /home.

function 02-a-1200


# -- 02-a-2100
# Създайте symlink на файла /etc/passwd в home директорията ви (да се казва 
# например passwd_symlink).

function 02-a-2100


# -- 02-a-4000
# Създайте файл permissions.txt в home директорията си. За него дайте 
# единствено - read права на потребителя създал файла, write and exec на групата,
#  read and exec на всички останали. Направете го и с битове, и чрез "буквички".

function 02-a-4000


# -- 02-a-4100
# За да намерите какво сте правили днес: намерете всички файлове в home 
# директорията ви, които са променени от вас в последния 1 час.

function 02-a-4100


# -- 02-a-5000
# Копирайте secret.txt от /tmp/os2018/02/ в home директорията си. 
# Прочетете го с командата cat. (Ако този файл го няма, прочетете с cat 
# произволен текстов файл напр. /etc/passwd)

function 02-a-5000


# -- 02-a-5400
# Изведете всички обикновени ("regular") файлове, които /etc и 
# нейните преки поддиректории съдържат

function 02-a-5400


# -- 02-a-5401
# Създайте файл, който да съдържа само първите 5 реда от изхода на 02-a-5400

function 02-a-5401


# -- 02-a-5402
# Изведете всички обикновени ("regular") файлове, които само 
# преките поддиректории на /etc съдържат

function 02-a-5402


# -- 02-a-5403
# Изведете всички преки поддиректории на /etc

function 02-a-5403


# -- 02-a-5500
# Създайте файл, който да съдържа само последните 10 реда от изхода на 02-a-5403

function 02-a-5500


# -- 02-a-5501
# Изведете обикновените файлове по-големи от 42 байта в home директорията ви

function 02-a-5501


# -- 02-a-5503
# Изведете всички обикновени файлове в директорията SI които са от групата student

function 02-a-5503


# -- 02-a-5504
# Изведете всички обикновени файлове в директорията SI които са 
# от групата student, които имат write права за достъп за група или 
# за останалите(o=w) // ако в свободното си време искате да пишете 
# по файлове на други хора

function 02-a-5504


# -- 02-a-5505
# Изведете всички файлове, които са по-нови от създадения файл в 02-a-5401

function 02-a-5505


# -- 02-a-5506
# Изтрийте файловете в home директорията си по-нови от създаденият 
# в 02-a-5401 файл (подайте на rm опция -i за да може да изберете само 
# тези които искате да изтриете)

function 02-a-5506


# -- 02-a-6000
# Намерете файловете в /bin, които могат да се четат, пишат и изпълняват от всички.

function 02-a-6000


# -- 02-a-8000
# Копирайте всички файлове от /bin, които могат да се четат, пишат 
# и изпълняват от всички, в bin2 директория в home директорията ви. 
# Направете такава, ако нямате.

function 02-a-8000


# -- 02-a-9000
# от предната задача: когато вече сте получили home/../../bin2 с команди, 
# архивирайте всички команди вътре, които започват с b в архив, който се 
# казва b_start.tar. (командата, която архивира е tar -c -f <файл1> <файл2>...)
# Можете ли да направите архив на всеки?

function 02-a-9000





# -- 02-a-9500
# Използвайки едно извикване на командата find, отпечатайте броя на 
# редовете във всеки обикновен файл в /home директорията.

function 02-a-9500


# -- 02-b-4000
# Копирайте най-големия файл от тези, намиращи се в /tmp/os2018/02/bytes/, 
# в home директорията си.

function 02-b-4000


